Revit 2024 API
BuiltInFailures.SketchFailures.CircleMultiPlanarShapeInSketch Property
 A circle can't be converted to multiplanar shape.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId CircleMultiPlanarShapeInSketch { get; }
Visual Basic
Public Shared ReadOnly Property CircleMultiPlanarShapeInSketch As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ CircleMultiPlanarShapeInSketch {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.SketchFailures Class
Autodesk.Revit.DB Namespace